TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE    1

       1                    ;******************************************************************************
       2                    ;* TI ARM C/C++ Codegen                                      Unix v18.1.3.LTS *
       3                    ;* Date/Time created: Mon Sep 17 16:09:26 2018                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --arm_vmrs_si_workaround=off --code_state=16 --embedded_constants=on
       6 00000000                   .thumb
       7                    
       8                    $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                            .dwattr $C$DW$CU, DW_AT_name("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/wifi/s
      10                            .dwattr $C$DW$CU, DW_AT_producer("TI TI ARM C/C++ Codegen Unix v18.1.3.LTS Copyright (c) 1996-
      11                            .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                            .dwattr $C$DW$CU, DW_AT_comp_dir("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/wi
      13                            .global SlNetIfConfigWifi

slnetifwifi.asm                                                      PAGE  112

    6102                            .dwattr $C$DW$609, DW_AT_decl_line(0x134)
    6103                            .dwattr $C$DW$609, DW_AT_decl_column(0x05)
    6104                    
    6105                    $C$DW$610       .dwtag  DW_TAG_enumerator
    6106                            .dwattr $C$DW$610, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MED")
    6107                            .dwattr $C$DW$610, DW_AT_const_value(0x04)
    6108                            .dwattr $C$DW$610, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/net/slnetsoc
    6109                            .dwattr $C$DW$610, DW_AT_decl_line(0x135)
    6110                            .dwattr $C$DW$610, DW_AT_decl_column(0x05)
    6111                    
    6112                    $C$DW$611       .dwtag  DW_TAG_enumerator
    6113                            .dwattr $C$DW$611, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_HIGH")
    6114                            .dwattr $C$DW$611, DW_AT_const_value(0x05)
    6115                            .dwattr $C$DW$611, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/net/slnetsoc
    6116                            .dwattr $C$DW$611, DW_AT_decl_line(0x136)
    6117                            .dwattr $C$DW$611, DW_AT_decl_column(0x05)
    6118                    
    6119                    $C$DW$612       .dwtag  DW_TAG_enumerator
    6120                            .dwattr $C$DW$612, DW_AT_name("SLNETSOCK_TX_INHIBIT_THRESHOLD_MAX")
    6121                            .dwattr $C$DW$612, DW_AT_const_value(0x06)
    6122                            .dwattr $C$DW$612, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/net/slnetsoc
    6123                            .dwattr $C$DW$612, DW_AT_decl_line(0x137)
    6124                            .dwattr $C$DW$612, DW_AT_decl_column(0x05)
    6125                    
    6126                            .dwattr $C$DW$T$515, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/net/slnets
    6127                            .dwattr $C$DW$T$515, DW_AT_decl_line(0x131)
    6128                            .dwattr $C$DW$T$515, DW_AT_decl_column(0x01)
    6129                            .dwendtag $C$DW$T$515
    6130                    
    6131                    $C$DW$T$516     .dwtag  DW_TAG_typedef
    6132                            .dwattr $C$DW$T$516, DW_AT_name("SlNetSockTxInhibitThreshold_e")
    6133                            .dwattr $C$DW$T$516, DW_AT_type(*$C$DW$T$515)
    6134                            .dwattr $C$DW$T$516, DW_AT_language(DW_LANG_C)
    6135                            .dwattr $C$DW$T$516, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/net/slnets
    6136                            .dwattr $C$DW$T$516, DW_AT_decl_line(0x138)
    6137                            .dwattr $C$DW$T$516, DW_AT_decl_column(0x03)
    6138                    
    6139                    
    6140                    $C$DW$T$517     .dwtag  DW_TAG_enumeration_type
    6141                            .dwattr $C$DW$T$517, DW_AT_byte_size(0x01)
    6142                    $C$DW$613       .dwtag  DW_TAG_enumerator
    6143                            .dwattr $C$DW$613, DW_AT_name("SLNETIF_STATE_DISABLE")
    6144                            .dwattr $C$DW$613, DW_AT_const_value(0x00)
    6145                            .dwattr $C$DW$613, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/net/slnetif.
    6146                            .dwattr $C$DW$613, DW_AT_decl_line(0x65)
    6147                            .dwattr $C$DW$613, DW_AT_decl_column(0x05)
    6148                    
    6149                    $C$DW$614       .dwtag  DW_TAG_enumerator
    6150                            .dwattr $C$DW$614, DW_AT_name("SLNETIF_STATE_ENABLE")
    6151                            .dwattr $C$DW$614, DW_AT_const_value(0x01)
    6152                            .dwattr $C$DW$614, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/net/slnetif.
    6153                            .dwattr $C$DW$614, DW_AT_decl_line(0x66)
    6154                            .dwattr $C$DW$614, DW_AT_decl_column(0x05)
    6155                    
    6156                            .dwattr $C$DW$T$517, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/net/slneti
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  113

    6157                            .dwattr $C$DW$T$517, DW_AT_decl_line(0x64)
    6158                            .dwattr $C$DW$T$517, DW_AT_decl_column(0x01)
    6159                            .dwendtag $C$DW$T$517
    6160                    
    6161                    $C$DW$T$518     .dwtag  DW_TAG_typedef
    6162                            .dwattr $C$DW$T$518, DW_AT_name("SlNetIfState_e")
    6163                            .dwattr $C$DW$T$518, DW_AT_type(*$C$DW$T$517)
    6164                            .dwattr $C$DW$T$518, DW_AT_language(DW_LANG_C)
    6165                            .dwattr $C$DW$T$518, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/net/slneti
    6166                            .dwattr $C$DW$T$518, DW_AT_decl_line(0x67)
    6167                            .dwattr $C$DW$T$518, DW_AT_decl_column(0x03)
    6168                    
    6169                    
    6170                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    6171                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x28)
    6172                    $C$DW$615       .dwtag  DW_TAG_member
    6173                            .dwattr $C$DW$615, DW_AT_type(*$C$DW$T$6)
    6174                            .dwattr $C$DW$615, DW_AT_name("SsidLen")
    6175                            .dwattr $C$DW$615, DW_AT_TI_symbol_name("SsidLen")
    6176                            .dwattr $C$DW$615, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6177                            .dwattr $C$DW$615, DW_AT_accessibility(DW_ACCESS_public)
    6178                            .dwattr $C$DW$615, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6179                            .dwattr $C$DW$615, DW_AT_decl_line(0x203)
    6180                            .dwattr $C$DW$615, DW_AT_decl_column(0x0d)
    6181                    
    6182                    $C$DW$616       .dwtag  DW_TAG_member
    6183                            .dwattr $C$DW$616, DW_AT_type(*$C$DW$T$23)
    6184                            .dwattr $C$DW$616, DW_AT_name("SsidName")
    6185                            .dwattr $C$DW$616, DW_AT_TI_symbol_name("SsidName")
    6186                            .dwattr $C$DW$616, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6187                            .dwattr $C$DW$616, DW_AT_accessibility(DW_ACCESS_public)
    6188                            .dwattr $C$DW$616, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6189                            .dwattr $C$DW$616, DW_AT_decl_line(0x204)
    6190                            .dwattr $C$DW$616, DW_AT_decl_column(0x0d)
    6191                    
    6192                    $C$DW$617       .dwtag  DW_TAG_member
    6193                            .dwattr $C$DW$617, DW_AT_type(*$C$DW$T$24)
    6194                            .dwattr $C$DW$617, DW_AT_name("Bssid")
    6195                            .dwattr $C$DW$617, DW_AT_TI_symbol_name("Bssid")
    6196                            .dwattr $C$DW$617, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6197                            .dwattr $C$DW$617, DW_AT_accessibility(DW_ACCESS_public)
    6198                            .dwattr $C$DW$617, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6199                            .dwattr $C$DW$617, DW_AT_decl_line(0x205)
    6200                            .dwattr $C$DW$617, DW_AT_decl_column(0x0d)
    6201                    
    6202                    $C$DW$618       .dwtag  DW_TAG_member
    6203                            .dwattr $C$DW$618, DW_AT_type(*$C$DW$T$6)
    6204                            .dwattr $C$DW$618, DW_AT_name("Padding")
    6205                            .dwattr $C$DW$618, DW_AT_TI_symbol_name("Padding")
    6206                            .dwattr $C$DW$618, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    6207                            .dwattr $C$DW$618, DW_AT_accessibility(DW_ACCESS_public)
    6208                            .dwattr $C$DW$618, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6209                            .dwattr $C$DW$618, DW_AT_decl_line(0x206)
    6210                            .dwattr $C$DW$618, DW_AT_decl_column(0x0d)
    6211                    
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  114

    6212                            .dwattr $C$DW$T$25, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6213                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x202)
    6214                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x01)
    6215                            .dwendtag $C$DW$T$25
    6216                    
    6217                    $C$DW$T$211     .dwtag  DW_TAG_typedef
    6218                            .dwattr $C$DW$T$211, DW_AT_name("SlWlanEventConnect_t")
    6219                            .dwattr $C$DW$T$211, DW_AT_type(*$C$DW$T$25)
    6220                            .dwattr $C$DW$T$211, DW_AT_language(DW_LANG_C)
    6221                            .dwattr $C$DW$T$211, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    6222                            .dwattr $C$DW$T$211, DW_AT_decl_line(0x207)
    6223                            .dwattr $C$DW$T$211, DW_AT_decl_column(0x03)
    6224                    
    6225                    
    6226                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    6227                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x4c)
    6228                    $C$DW$619       .dwtag  DW_TAG_member
    6229                            .dwattr $C$DW$619, DW_AT_type(*$C$DW$T$6)
    6230                            .dwattr $C$DW$619, DW_AT_name("SsidLen")
    6231                            .dwattr $C$DW$619, DW_AT_TI_symbol_name("SsidLen")
    6232                            .dwattr $C$DW$619, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6233                            .dwattr $C$DW$619, DW_AT_accessibility(DW_ACCESS_public)
    6234                            .dwattr $C$DW$619, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6235                            .dwattr $C$DW$619, DW_AT_decl_line(0x21a)
    6236                            .dwattr $C$DW$619, DW_AT_decl_column(0x0d)
    6237                    
    6238                    $C$DW$620       .dwtag  DW_TAG_member
    6239                            .dwattr $C$DW$620, DW_AT_type(*$C$DW$T$23)
    6240                            .dwattr $C$DW$620, DW_AT_name("SsidName")
    6241                            .dwattr $C$DW$620, DW_AT_TI_symbol_name("SsidName")
    6242                            .dwattr $C$DW$620, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6243                            .dwattr $C$DW$620, DW_AT_accessibility(DW_ACCESS_public)
    6244                            .dwattr $C$DW$620, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6245                            .dwattr $C$DW$620, DW_AT_decl_line(0x21b)
    6246                            .dwattr $C$DW$620, DW_AT_decl_column(0x0d)
    6247                    
    6248                    $C$DW$621       .dwtag  DW_TAG_member
    6249                            .dwattr $C$DW$621, DW_AT_type(*$C$DW$T$24)
    6250                            .dwattr $C$DW$621, DW_AT_name("Bssid")
    6251                            .dwattr $C$DW$621, DW_AT_TI_symbol_name("Bssid")
    6252                            .dwattr $C$DW$621, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    6253                            .dwattr $C$DW$621, DW_AT_accessibility(DW_ACCESS_public)
    6254                            .dwattr $C$DW$621, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6255                            .dwattr $C$DW$621, DW_AT_decl_line(0x21c)
    6256                            .dwattr $C$DW$621, DW_AT_decl_column(0x0d)
    6257                    
    6258                    $C$DW$622       .dwtag  DW_TAG_member
    6259                            .dwattr $C$DW$622, DW_AT_type(*$C$DW$T$6)
    6260                            .dwattr $C$DW$622, DW_AT_name("Reserved")
    6261                            .dwattr $C$DW$622, DW_AT_TI_symbol_name("Reserved")
    6262                            .dwattr $C$DW$622, DW_AT_data_member_location[DW_OP_plus_uconst 0x27]
    6263                            .dwattr $C$DW$622, DW_AT_accessibility(DW_ACCESS_public)
    6264                            .dwattr $C$DW$622, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6265                            .dwattr $C$DW$622, DW_AT_decl_line(0x21d)
    6266                            .dwattr $C$DW$622, DW_AT_decl_column(0x0d)
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  115

    6267                    
    6268                    $C$DW$623       .dwtag  DW_TAG_member
    6269                            .dwattr $C$DW$623, DW_AT_type(*$C$DW$T$6)
    6270                            .dwattr $C$DW$623, DW_AT_name("GoDeviceNameLen")
    6271                            .dwattr $C$DW$623, DW_AT_TI_symbol_name("GoDeviceNameLen")
    6272                            .dwattr $C$DW$623, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6273                            .dwattr $C$DW$623, DW_AT_accessibility(DW_ACCESS_public)
    6274                            .dwattr $C$DW$623, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6275                            .dwattr $C$DW$623, DW_AT_decl_line(0x21e)
    6276                            .dwattr $C$DW$623, DW_AT_decl_column(0x0d)
    6277                    
    6278                    $C$DW$624       .dwtag  DW_TAG_member
    6279                            .dwattr $C$DW$624, DW_AT_type(*$C$DW$T$23)
    6280                            .dwattr $C$DW$624, DW_AT_name("GoDeviceName")
    6281                            .dwattr $C$DW$624, DW_AT_TI_symbol_name("GoDeviceName")
    6282                            .dwattr $C$DW$624, DW_AT_data_member_location[DW_OP_plus_uconst 0x29]
    6283                            .dwattr $C$DW$624, DW_AT_accessibility(DW_ACCESS_public)
    6284                            .dwattr $C$DW$624, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6285                            .dwattr $C$DW$624, DW_AT_decl_line(0x21f)
    6286                            .dwattr $C$DW$624, DW_AT_decl_column(0x0d)
    6287                    
    6288                    $C$DW$625       .dwtag  DW_TAG_member
    6289                            .dwattr $C$DW$625, DW_AT_type(*$C$DW$T$26)
    6290                            .dwattr $C$DW$625, DW_AT_name("Padding")
    6291                            .dwattr $C$DW$625, DW_AT_TI_symbol_name("Padding")
    6292                            .dwattr $C$DW$625, DW_AT_data_member_location[DW_OP_plus_uconst 0x49]
    6293                            .dwattr $C$DW$625, DW_AT_accessibility(DW_ACCESS_public)
    6294                            .dwattr $C$DW$625, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6295                            .dwattr $C$DW$625, DW_AT_decl_line(0x220)
    6296                            .dwattr $C$DW$625, DW_AT_decl_column(0x0d)
    6297                    
    6298                            .dwattr $C$DW$T$27, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6299                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x219)
    6300                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x01)
    6301                            .dwendtag $C$DW$T$27
    6302                    
    6303                    $C$DW$T$212     .dwtag  DW_TAG_typedef
    6304                            .dwattr $C$DW$T$212, DW_AT_name("SlWlanEventP2PConnect_t")
    6305                            .dwattr $C$DW$T$212, DW_AT_type(*$C$DW$T$27)
    6306                            .dwattr $C$DW$T$212, DW_AT_language(DW_LANG_C)
    6307                            .dwattr $C$DW$T$212, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    6308                            .dwattr $C$DW$T$212, DW_AT_decl_line(0x221)
    6309                            .dwattr $C$DW$T$212, DW_AT_decl_column(0x03)
    6310                    
    6311                    
    6312                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    6313                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x50)
    6314                    $C$DW$626       .dwtag  DW_TAG_member
    6315                            .dwattr $C$DW$626, DW_AT_type(*$C$DW$T$6)
    6316                            .dwattr $C$DW$626, DW_AT_name("Mode")
    6317                            .dwattr $C$DW$626, DW_AT_TI_symbol_name("Mode")
    6318                            .dwattr $C$DW$626, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6319                            .dwattr $C$DW$626, DW_AT_accessibility(DW_ACCESS_public)
    6320                            .dwattr $C$DW$626, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6321                            .dwattr $C$DW$626, DW_AT_decl_line(0x2c8)
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  116

    6322                            .dwattr $C$DW$626, DW_AT_decl_column(0x09)
    6323                    
    6324                    $C$DW$627       .dwtag  DW_TAG_member
    6325                            .dwattr $C$DW$627, DW_AT_type(*$C$DW$T$6)
    6326                            .dwattr $C$DW$627, DW_AT_name("ConnStatus")
    6327                            .dwattr $C$DW$627, DW_AT_TI_symbol_name("ConnStatus")
    6328                            .dwattr $C$DW$627, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6329                            .dwattr $C$DW$627, DW_AT_accessibility(DW_ACCESS_public)
    6330                            .dwattr $C$DW$627, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6331                            .dwattr $C$DW$627, DW_AT_decl_line(0x2c9)
    6332                            .dwattr $C$DW$627, DW_AT_decl_column(0x09)
    6333                    
    6334                    $C$DW$628       .dwtag  DW_TAG_member
    6335                            .dwattr $C$DW$628, DW_AT_type(*$C$DW$T$6)
    6336                            .dwattr $C$DW$628, DW_AT_name("SecType")
    6337                            .dwattr $C$DW$628, DW_AT_TI_symbol_name("SecType")
    6338                            .dwattr $C$DW$628, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6339                            .dwattr $C$DW$628, DW_AT_accessibility(DW_ACCESS_public)
    6340                            .dwattr $C$DW$628, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6341                            .dwattr $C$DW$628, DW_AT_decl_line(0x2ca)
    6342                            .dwattr $C$DW$628, DW_AT_decl_column(0x09)
    6343                    
    6344                    $C$DW$629       .dwtag  DW_TAG_member
    6345                            .dwattr $C$DW$629, DW_AT_type(*$C$DW$T$6)
    6346                            .dwattr $C$DW$629, DW_AT_name("Reserved")
    6347                            .dwattr $C$DW$629, DW_AT_TI_symbol_name("Reserved")
    6348                            .dwattr $C$DW$629, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    6349                            .dwattr $C$DW$629, DW_AT_accessibility(DW_ACCESS_public)
    6350                            .dwattr $C$DW$629, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6351                            .dwattr $C$DW$629, DW_AT_decl_line(0x2cb)
    6352                            .dwattr $C$DW$629, DW_AT_decl_column(0x09)
    6353                    
    6354                    $C$DW$630       .dwtag  DW_TAG_member
    6355                            .dwattr $C$DW$630, DW_AT_type(*$C$DW$T$28)
    6356                            .dwattr $C$DW$630, DW_AT_name("ConnectionInfo")
    6357                            .dwattr $C$DW$630, DW_AT_TI_symbol_name("ConnectionInfo")
    6358                            .dwattr $C$DW$630, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6359                            .dwattr $C$DW$630, DW_AT_accessibility(DW_ACCESS_public)
    6360                            .dwattr $C$DW$630, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6361                            .dwattr $C$DW$630, DW_AT_decl_line(0x2cc)
    6362                            .dwattr $C$DW$630, DW_AT_decl_column(0x1c)
    6363                    
    6364                            .dwattr $C$DW$T$29, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6365                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x2c7)
    6366                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x01)
    6367                            .dwendtag $C$DW$T$29
    6368                    
    6369                    $C$DW$T$519     .dwtag  DW_TAG_typedef
    6370                            .dwattr $C$DW$T$519, DW_AT_name("SlWlanConnStatusParam_t")
    6371                            .dwattr $C$DW$T$519, DW_AT_type(*$C$DW$T$29)
    6372                            .dwattr $C$DW$T$519, DW_AT_language(DW_LANG_C)
    6373                            .dwattr $C$DW$T$519, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    6374                            .dwattr $C$DW$T$519, DW_AT_decl_line(0x2cd)
    6375                            .dwattr $C$DW$T$519, DW_AT_decl_column(0x02)
    6376                    
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  117

    6377                    
    6378                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    6379                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    6380                    $C$DW$631       .dwtag  DW_TAG_member
    6381                            .dwattr $C$DW$631, DW_AT_type(*$C$DW$T$14)
    6382                            .dwattr $C$DW$631, DW_AT_name("__max_align1")
    6383                            .dwattr $C$DW$631, DW_AT_TI_symbol_name("__max_align1")
    6384                            .dwattr $C$DW$631, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6385                            .dwattr $C$DW$631, DW_AT_accessibility(DW_ACCESS_public)
    6386                            .dwattr $C$DW$631, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6387                            .dwattr $C$DW$631, DW_AT_decl_line(0x70)
    6388                            .dwattr $C$DW$631, DW_AT_decl_column(0x0c)
    6389                    
    6390                    $C$DW$632       .dwtag  DW_TAG_member
    6391                            .dwattr $C$DW$632, DW_AT_type(*$C$DW$T$18)
    6392                            .dwattr $C$DW$632, DW_AT_name("__max_align2")
    6393                            .dwattr $C$DW$632, DW_AT_TI_symbol_name("__max_align2")
    6394                            .dwattr $C$DW$632, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6395                            .dwattr $C$DW$632, DW_AT_accessibility(DW_ACCESS_public)
    6396                            .dwattr $C$DW$632, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6397                            .dwattr $C$DW$632, DW_AT_decl_line(0x71)
    6398                            .dwattr $C$DW$632, DW_AT_decl_column(0x0e)
    6399                    
    6400                            .dwattr $C$DW$T$30, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3
    6401                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x6f)
    6402                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    6403                            .dwendtag $C$DW$T$30
    6404                    
    6405                    $C$DW$T$521     .dwtag  DW_TAG_typedef
    6406                            .dwattr $C$DW$T$521, DW_AT_name("__max_align_t")
    6407                            .dwattr $C$DW$T$521, DW_AT_type(*$C$DW$T$30)
    6408                            .dwattr $C$DW$T$521, DW_AT_language(DW_LANG_C)
    6409                            .dwattr $C$DW$T$521, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
    6410                            .dwattr $C$DW$T$521, DW_AT_decl_line(0x72)
    6411                            .dwattr $C$DW$T$521, DW_AT_decl_column(0x03)
    6412                    
    6413                    
    6414                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6415                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
    6416                    $C$DW$633       .dwtag  DW_TAG_member
    6417                            .dwattr $C$DW$633, DW_AT_type(*$C$DW$T$8)
    6418                            .dwattr $C$DW$633, DW_AT_name("daylight")
    6419                            .dwattr $C$DW$633, DW_AT_TI_symbol_name("daylight")
    6420                            .dwattr $C$DW$633, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6421                            .dwattr $C$DW$633, DW_AT_accessibility(DW_ACCESS_public)
    6422                            .dwattr $C$DW$633, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6423                            .dwattr $C$DW$633, DW_AT_decl_line(0x93)
    6424                            .dwattr $C$DW$633, DW_AT_decl_column(0x0b)
    6425                    
    6426                    $C$DW$634       .dwtag  DW_TAG_member
    6427                            .dwattr $C$DW$634, DW_AT_type(*$C$DW$T$12)
    6428                            .dwattr $C$DW$634, DW_AT_name("timezone")
    6429                            .dwattr $C$DW$634, DW_AT_TI_symbol_name("timezone")
    6430                            .dwattr $C$DW$634, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6431                            .dwattr $C$DW$634, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  118

    6432                            .dwattr $C$DW$634, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6433                            .dwattr $C$DW$634, DW_AT_decl_line(0x94)
    6434                            .dwattr $C$DW$634, DW_AT_decl_column(0x0b)
    6435                    
    6436                    $C$DW$635       .dwtag  DW_TAG_member
    6437                            .dwattr $C$DW$635, DW_AT_type(*$C$DW$T$32)
    6438                            .dwattr $C$DW$635, DW_AT_name("tzname")
    6439                            .dwattr $C$DW$635, DW_AT_TI_symbol_name("tzname")
    6440                            .dwattr $C$DW$635, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6441                            .dwattr $C$DW$635, DW_AT_accessibility(DW_ACCESS_public)
    6442                            .dwattr $C$DW$635, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6443                            .dwattr $C$DW$635, DW_AT_decl_line(0x95)
    6444                            .dwattr $C$DW$635, DW_AT_decl_column(0x0b)
    6445                    
    6446                    $C$DW$636       .dwtag  DW_TAG_member
    6447                            .dwattr $C$DW$636, DW_AT_type(*$C$DW$T$32)
    6448                            .dwattr $C$DW$636, DW_AT_name("dstname")
    6449                            .dwattr $C$DW$636, DW_AT_TI_symbol_name("dstname")
    6450                            .dwattr $C$DW$636, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6451                            .dwattr $C$DW$636, DW_AT_accessibility(DW_ACCESS_public)
    6452                            .dwattr $C$DW$636, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6453                            .dwattr $C$DW$636, DW_AT_decl_line(0x96)
    6454                            .dwattr $C$DW$636, DW_AT_decl_column(0x0b)
    6455                    
    6456                            .dwattr $C$DW$T$33, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3
    6457                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x92)
    6458                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x01)
    6459                            .dwendtag $C$DW$T$33
    6460                    
    6461                    $C$DW$T$522     .dwtag  DW_TAG_typedef
    6462                            .dwattr $C$DW$T$522, DW_AT_name("TZ")
    6463                            .dwattr $C$DW$T$522, DW_AT_type(*$C$DW$T$33)
    6464                            .dwattr $C$DW$T$522, DW_AT_language(DW_LANG_C)
    6465                            .dwattr $C$DW$T$522, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
    6466                            .dwattr $C$DW$T$522, DW_AT_decl_line(0x97)
    6467                            .dwattr $C$DW$T$522, DW_AT_decl_column(0x03)
    6468                    
    6469                    
    6470                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    6471                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    6472                    $C$DW$637       .dwtag  DW_TAG_member
    6473                            .dwattr $C$DW$637, DW_AT_type(*$C$DW$T$36)
    6474                            .dwattr $C$DW$637, DW_AT_name("pEntry")
    6475                            .dwattr $C$DW$637, DW_AT_TI_symbol_name("pEntry")
    6476                            .dwattr $C$DW$637, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6477                            .dwattr $C$DW$637, DW_AT_accessibility(DW_ACCESS_public)
    6478                            .dwattr $C$DW$637, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6479                            .dwattr $C$DW$637, DW_AT_decl_line(0x7c)
    6480                            .dwattr $C$DW$637, DW_AT_decl_column(0x16)
    6481                    
    6482                    $C$DW$638       .dwtag  DW_TAG_member
    6483                            .dwattr $C$DW$638, DW_AT_type(*$C$DW$T$3)
    6484                            .dwattr $C$DW$638, DW_AT_name("pValue")
    6485                            .dwattr $C$DW$638, DW_AT_TI_symbol_name("pValue")
    6486                            .dwattr $C$DW$638, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  119

    6487                            .dwattr $C$DW$638, DW_AT_accessibility(DW_ACCESS_public)
    6488                            .dwattr $C$DW$638, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6489                            .dwattr $C$DW$638, DW_AT_decl_line(0x7d)
    6490                            .dwattr $C$DW$638, DW_AT_decl_column(0x0b)
    6491                    
    6492                            .dwattr $C$DW$T$37, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6493                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x7b)
    6494                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    6495                            .dwendtag $C$DW$T$37
    6496                    
    6497                    $C$DW$T$523     .dwtag  DW_TAG_typedef
    6498                            .dwattr $C$DW$T$523, DW_AT_name("tSimpleLinkSpawnMsg")
    6499                            .dwattr $C$DW$T$523, DW_AT_type(*$C$DW$T$37)
    6500                            .dwattr $C$DW$T$523, DW_AT_language(DW_LANG_C)
    6501                            .dwattr $C$DW$T$523, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    6502                            .dwattr $C$DW$T$523, DW_AT_decl_line(0x7e)
    6503                            .dwattr $C$DW$T$523, DW_AT_decl_column(0x02)
    6504                    
    6505                    
    6506                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    6507                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x08)
    6508                    $C$DW$639       .dwtag  DW_TAG_member
    6509                            .dwattr $C$DW$639, DW_AT_type(*$C$DW$T$10)
    6510                            .dwattr $C$DW$639, DW_AT_name("quot")
    6511                            .dwattr $C$DW$639, DW_AT_TI_symbol_name("quot")
    6512                            .dwattr $C$DW$639, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6513                            .dwattr $C$DW$639, DW_AT_accessibility(DW_ACCESS_public)
    6514                            .dwattr $C$DW$639, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6515                            .dwattr $C$DW$639, DW_AT_decl_line(0x49)
    6516                            .dwattr $C$DW$639, DW_AT_decl_column(0x16)
    6517                    
    6518                    $C$DW$640       .dwtag  DW_TAG_member
    6519                            .dwattr $C$DW$640, DW_AT_type(*$C$DW$T$10)
    6520                            .dwattr $C$DW$640, DW_AT_name("rem")
    6521                            .dwattr $C$DW$640, DW_AT_TI_symbol_name("rem")
    6522                            .dwattr $C$DW$640, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6523                            .dwattr $C$DW$640, DW_AT_accessibility(DW_ACCESS_public)
    6524                            .dwattr $C$DW$640, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6525                            .dwattr $C$DW$640, DW_AT_decl_line(0x49)
    6526                            .dwattr $C$DW$640, DW_AT_decl_column(0x1c)
    6527                    
    6528                            .dwattr $C$DW$T$38, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3
    6529                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x49)
    6530                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    6531                            .dwendtag $C$DW$T$38
    6532                    
    6533                    $C$DW$T$524     .dwtag  DW_TAG_typedef
    6534                            .dwattr $C$DW$T$524, DW_AT_name("div_t")
    6535                            .dwattr $C$DW$T$524, DW_AT_type(*$C$DW$T$38)
    6536                            .dwattr $C$DW$T$524, DW_AT_language(DW_LANG_C)
    6537                            .dwattr $C$DW$T$524, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
    6538                            .dwattr $C$DW$T$524, DW_AT_decl_line(0x49)
    6539                            .dwattr $C$DW$T$524, DW_AT_decl_column(0x23)
    6540                    
    6541                    
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  120

    6542                    $C$DW$T$39      .dwtag  DW_TAG_structure_type
    6543                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x08)
    6544                    $C$DW$641       .dwtag  DW_TAG_member
    6545                            .dwattr $C$DW$641, DW_AT_type(*$C$DW$T$10)
    6546                            .dwattr $C$DW$641, DW_AT_name("quot")
    6547                            .dwattr $C$DW$641, DW_AT_TI_symbol_name("quot")
    6548                            .dwattr $C$DW$641, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6549                            .dwattr $C$DW$641, DW_AT_accessibility(DW_ACCESS_public)
    6550                            .dwattr $C$DW$641, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6551                            .dwattr $C$DW$641, DW_AT_decl_line(0x4e)
    6552                            .dwattr $C$DW$641, DW_AT_decl_column(0x16)
    6553                    
    6554                    $C$DW$642       .dwtag  DW_TAG_member
    6555                            .dwattr $C$DW$642, DW_AT_type(*$C$DW$T$10)
    6556                            .dwattr $C$DW$642, DW_AT_name("rem")
    6557                            .dwattr $C$DW$642, DW_AT_TI_symbol_name("rem")
    6558                            .dwattr $C$DW$642, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6559                            .dwattr $C$DW$642, DW_AT_accessibility(DW_ACCESS_public)
    6560                            .dwattr $C$DW$642, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6561                            .dwattr $C$DW$642, DW_AT_decl_line(0x4e)
    6562                            .dwattr $C$DW$642, DW_AT_decl_column(0x1c)
    6563                    
    6564                            .dwattr $C$DW$T$39, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3
    6565                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x4e)
    6566                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
    6567                            .dwendtag $C$DW$T$39
    6568                    
    6569                    $C$DW$T$525     .dwtag  DW_TAG_typedef
    6570                            .dwattr $C$DW$T$525, DW_AT_name("ldiv_t")
    6571                            .dwattr $C$DW$T$525, DW_AT_type(*$C$DW$T$39)
    6572                            .dwattr $C$DW$T$525, DW_AT_language(DW_LANG_C)
    6573                            .dwattr $C$DW$T$525, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
    6574                            .dwattr $C$DW$T$525, DW_AT_decl_line(0x4e)
    6575                            .dwattr $C$DW$T$525, DW_AT_decl_column(0x23)
    6576                    
    6577                    
    6578                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    6579                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x10)
    6580                    $C$DW$643       .dwtag  DW_TAG_member
    6581                            .dwattr $C$DW$643, DW_AT_type(*$C$DW$T$14)
    6582                            .dwattr $C$DW$643, DW_AT_name("quot")
    6583                            .dwattr $C$DW$643, DW_AT_TI_symbol_name("quot")
    6584                            .dwattr $C$DW$643, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6585                            .dwattr $C$DW$643, DW_AT_accessibility(DW_ACCESS_public)
    6586                            .dwattr $C$DW$643, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
    6587                            .dwattr $C$DW$643, DW_AT_decl_line(0x56)
    6588                            .dwattr $C$DW$643, DW_AT_decl_column(0x1c)
    6589                    
    6590                    $C$DW$644       .dwtag  DW_TAG_member
    6591                            .dwattr $C$DW$644, DW_AT_type(*$C$DW$T$14)
    6592                            .dwattr $C$DW$644, DW_AT_name("rem")
    6593                            .dwattr $C$DW$644, DW_AT_TI_symbol_name("rem")
    6594                            .dwattr $C$DW$644, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6595                            .dwattr $C$DW$644, DW_AT_accessibility(DW_ACCESS_public)
    6596                            .dwattr $C$DW$644, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3.
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  121

    6597                            .dwattr $C$DW$644, DW_AT_decl_line(0x56)
    6598                            .dwattr $C$DW$644, DW_AT_decl_column(0x22)
    6599                    
    6600                            .dwattr $C$DW$T$40, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.3
    6601                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x56)
    6602                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    6603                            .dwendtag $C$DW$T$40
    6604                    
    6605                    $C$DW$T$526     .dwtag  DW_TAG_typedef
    6606                            .dwattr $C$DW$T$526, DW_AT_name("lldiv_t")
    6607                            .dwattr $C$DW$T$526, DW_AT_type(*$C$DW$T$40)
    6608                            .dwattr $C$DW$T$526, DW_AT_language(DW_LANG_C)
    6609                            .dwattr $C$DW$T$526, DW_AT_decl_file("/opt/ti/ccs-latest/ccsv8/tools/compiler/ti-cgt-arm_18.1.
    6610                            .dwattr $C$DW$T$526, DW_AT_decl_line(0x56)
    6611                            .dwattr $C$DW$T$526, DW_AT_decl_column(0x29)
    6612                    
    6613                    
    6614                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    6615                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x24)
    6616                    $C$DW$645       .dwtag  DW_TAG_member
    6617                            .dwattr $C$DW$645, DW_AT_type(*$C$DW$T$9)
    6618                            .dwattr $C$DW$645, DW_AT_name("Flags")
    6619                            .dwattr $C$DW$645, DW_AT_TI_symbol_name("Flags")
    6620                            .dwattr $C$DW$645, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6621                            .dwattr $C$DW$645, DW_AT_accessibility(DW_ACCESS_public)
    6622                            .dwattr $C$DW$645, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6623                            .dwattr $C$DW$645, DW_AT_decl_line(0x90)
    6624                            .dwattr $C$DW$645, DW_AT_decl_column(0x0b)
    6625                    
    6626                    $C$DW$646       .dwtag  DW_TAG_member
    6627                            .dwattr $C$DW$646, DW_AT_type(*$C$DW$T$13)
    6628                            .dwattr $C$DW$646, DW_AT_name("Len")
    6629                            .dwattr $C$DW$646, DW_AT_TI_symbol_name("Len")
    6630                            .dwattr $C$DW$646, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6631                            .dwattr $C$DW$646, DW_AT_accessibility(DW_ACCESS_public)
    6632                            .dwattr $C$DW$646, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6633                            .dwattr $C$DW$646, DW_AT_decl_line(0x91)
    6634                            .dwattr $C$DW$646, DW_AT_decl_column(0x0b)
    6635                    
    6636                    $C$DW$647       .dwtag  DW_TAG_member
    6637                            .dwattr $C$DW$647, DW_AT_type(*$C$DW$T$13)
    6638                            .dwattr $C$DW$647, DW_AT_name("MaxSize")
    6639                            .dwattr $C$DW$647, DW_AT_TI_symbol_name("MaxSize")
    6640                            .dwattr $C$DW$647, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6641                            .dwattr $C$DW$647, DW_AT_accessibility(DW_ACCESS_public)
    6642                            .dwattr $C$DW$647, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6643                            .dwattr $C$DW$647, DW_AT_decl_line(0x92)
    6644                            .dwattr $C$DW$647, DW_AT_decl_column(0x0b)
    6645                    
    6646                    $C$DW$648       .dwtag  DW_TAG_member
    6647                            .dwattr $C$DW$648, DW_AT_type(*$C$DW$T$41)
    6648                            .dwattr $C$DW$648, DW_AT_name("Token")
    6649                            .dwattr $C$DW$648, DW_AT_TI_symbol_name("Token")
    6650                            .dwattr $C$DW$648, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6651                            .dwattr $C$DW$648, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  122

    6652                            .dwattr $C$DW$648, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6653                            .dwattr $C$DW$648, DW_AT_decl_line(0x93)
    6654                            .dwattr $C$DW$648, DW_AT_decl_column(0x0b)
    6655                    
    6656                    $C$DW$649       .dwtag  DW_TAG_member
    6657                            .dwattr $C$DW$649, DW_AT_type(*$C$DW$T$13)
    6658                            .dwattr $C$DW$649, DW_AT_name("StorageSize")
    6659                            .dwattr $C$DW$649, DW_AT_TI_symbol_name("StorageSize")
    6660                            .dwattr $C$DW$649, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6661                            .dwattr $C$DW$649, DW_AT_accessibility(DW_ACCESS_public)
    6662                            .dwattr $C$DW$649, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6663                            .dwattr $C$DW$649, DW_AT_decl_line(0x94)
    6664                            .dwattr $C$DW$649, DW_AT_decl_column(0x0b)
    6665                    
    6666                    $C$DW$650       .dwtag  DW_TAG_member
    6667                            .dwattr $C$DW$650, DW_AT_type(*$C$DW$T$13)
    6668                            .dwattr $C$DW$650, DW_AT_name("WriteCounter")
    6669                            .dwattr $C$DW$650, DW_AT_TI_symbol_name("WriteCounter")
    6670                            .dwattr $C$DW$650, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6671                            .dwattr $C$DW$650, DW_AT_accessibility(DW_ACCESS_public)
    6672                            .dwattr $C$DW$650, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6673                            .dwattr $C$DW$650, DW_AT_decl_line(0x95)
    6674                            .dwattr $C$DW$650, DW_AT_decl_column(0x0b)
    6675                    
    6676                            .dwattr $C$DW$T$42, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6677                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x8f)
    6678                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    6679                            .dwendtag $C$DW$T$42
    6680                    
    6681                    $C$DW$T$527     .dwtag  DW_TAG_typedef
    6682                            .dwattr $C$DW$T$527, DW_AT_name("SlFsFileInfo_t")
    6683                            .dwattr $C$DW$T$527, DW_AT_type(*$C$DW$T$42)
    6684                            .dwattr $C$DW$T$527, DW_AT_language(DW_LANG_C)
    6685                            .dwattr $C$DW$T$527, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    6686                            .dwattr $C$DW$T$527, DW_AT_decl_line(0x96)
    6687                            .dwattr $C$DW$T$527, DW_AT_decl_column(0x02)
    6688                    
    6689                    
    6690                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6691                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x10)
    6692                    $C$DW$651       .dwtag  DW_TAG_member
    6693                            .dwattr $C$DW$651, DW_AT_type(*$C$DW$T$41)
    6694                            .dwattr $C$DW$651, DW_AT_name("Key")
    6695                            .dwattr $C$DW$651, DW_AT_TI_symbol_name("Key")
    6696                            .dwattr $C$DW$651, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6697                            .dwattr $C$DW$651, DW_AT_accessibility(DW_ACCESS_public)
    6698                            .dwattr $C$DW$651, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6699                            .dwattr $C$DW$651, DW_AT_decl_line(0xb1)
    6700                            .dwattr $C$DW$651, DW_AT_decl_column(0x0b)
    6701                    
    6702                            .dwattr $C$DW$T$43, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6703                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xb0)
    6704                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x01)
    6705                            .dwendtag $C$DW$T$43
    6706                    
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  123

    6707                    $C$DW$T$528     .dwtag  DW_TAG_typedef
    6708                            .dwattr $C$DW$T$528, DW_AT_name("SlFsKey_t")
    6709                            .dwattr $C$DW$T$528, DW_AT_type(*$C$DW$T$43)
    6710                            .dwattr $C$DW$T$528, DW_AT_language(DW_LANG_C)
    6711                            .dwattr $C$DW$T$528, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    6712                            .dwattr $C$DW$T$528, DW_AT_decl_line(0xb2)
    6713                            .dwattr $C$DW$T$528, DW_AT_decl_column(0x02)
    6714                    
    6715                    
    6716                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    6717                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    6718                    $C$DW$652       .dwtag  DW_TAG_member
    6719                            .dwattr $C$DW$652, DW_AT_type(*$C$DW$T$6)
    6720                            .dwattr $C$DW$652, DW_AT_name("Index")
    6721                            .dwattr $C$DW$652, DW_AT_TI_symbol_name("Index")
    6722                            .dwattr $C$DW$652, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6723                            .dwattr $C$DW$652, DW_AT_accessibility(DW_ACCESS_public)
    6724                            .dwattr $C$DW$652, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6725                            .dwattr $C$DW$652, DW_AT_decl_line(0xb6)
    6726                            .dwattr $C$DW$652, DW_AT_decl_column(0x09)
    6727                    
    6728                            .dwattr $C$DW$T$44, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6729                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xb5)
    6730                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x01)
    6731                            .dwendtag $C$DW$T$44
    6732                    
    6733                    $C$DW$T$219     .dwtag  DW_TAG_typedef
    6734                            .dwattr $C$DW$T$219, DW_AT_name("SlFsFileNameIndex_t")
    6735                            .dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$44)
    6736                            .dwattr $C$DW$T$219, DW_AT_language(DW_LANG_C)
    6737                            .dwattr $C$DW$T$219, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    6738                            .dwattr $C$DW$T$219, DW_AT_decl_line(0xb7)
    6739                            .dwattr $C$DW$T$219, DW_AT_decl_column(0x02)
    6740                    
    6741                    
    6742                    $C$DW$T$45      .dwtag  DW_TAG_structure_type
    6743                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x04)
    6744                    $C$DW$653       .dwtag  DW_TAG_member
    6745                            .dwattr $C$DW$653, DW_AT_type(*$C$DW$T$13)
    6746                            .dwattr $C$DW$653, DW_AT_name("Operation")
    6747                            .dwattr $C$DW$653, DW_AT_TI_symbol_name("Operation")
    6748                            .dwattr $C$DW$653, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6749                            .dwattr $C$DW$653, DW_AT_accessibility(DW_ACCESS_public)
    6750                            .dwattr $C$DW$653, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6751                            .dwattr $C$DW$653, DW_AT_decl_line(0xca)
    6752                            .dwattr $C$DW$653, DW_AT_decl_column(0x08)
    6753                    
    6754                            .dwattr $C$DW$T$45, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6755                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xc9)
    6756                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x01)
    6757                            .dwendtag $C$DW$T$45
    6758                    
    6759                    $C$DW$T$529     .dwtag  DW_TAG_typedef
    6760                            .dwattr $C$DW$T$529, DW_AT_name("SlFsRetToFactoryCommand_t")
    6761                            .dwattr $C$DW$T$529, DW_AT_type(*$C$DW$T$45)
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  124

    6762                            .dwattr $C$DW$T$529, DW_AT_language(DW_LANG_C)
    6763                            .dwattr $C$DW$T$529, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    6764                            .dwattr $C$DW$T$529, DW_AT_decl_line(0xcb)
    6765                            .dwattr $C$DW$T$529, DW_AT_decl_column(0x02)
    6766                    
    6767                    
    6768                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    6769                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    6770                    $C$DW$654       .dwtag  DW_TAG_member
    6771                            .dwattr $C$DW$654, DW_AT_type(*$C$DW$T$13)
    6772                            .dwattr $C$DW$654, DW_AT_name("IncludeFilters")
    6773                            .dwattr $C$DW$654, DW_AT_TI_symbol_name("IncludeFilters")
    6774                            .dwattr $C$DW$654, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6775                            .dwattr $C$DW$654, DW_AT_accessibility(DW_ACCESS_public)
    6776                            .dwattr $C$DW$654, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6777                            .dwattr $C$DW$654, DW_AT_decl_line(0xd1)
    6778                            .dwattr $C$DW$654, DW_AT_decl_column(0x12)
    6779                    
    6780                            .dwattr $C$DW$T$46, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6781                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xd0)
    6782                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x01)
    6783                            .dwendtag $C$DW$T$46
    6784                    
    6785                    $C$DW$T$530     .dwtag  DW_TAG_typedef
    6786                            .dwattr $C$DW$T$530, DW_AT_name("SlFsControl_t")
    6787                            .dwattr $C$DW$T$530, DW_AT_type(*$C$DW$T$46)
    6788                            .dwattr $C$DW$T$530, DW_AT_language(DW_LANG_C)
    6789                            .dwattr $C$DW$T$530, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    6790                            .dwattr $C$DW$T$530, DW_AT_decl_line(0xd3)
    6791                            .dwattr $C$DW$T$530, DW_AT_decl_column(0x02)
    6792                    
    6793                    
    6794                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    6795                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x10)
    6796                    $C$DW$655       .dwtag  DW_TAG_member
    6797                            .dwattr $C$DW$655, DW_AT_type(*$C$DW$T$9)
    6798                            .dwattr $C$DW$655, DW_AT_name("DeviceBlockSize")
    6799                            .dwattr $C$DW$655, DW_AT_TI_symbol_name("DeviceBlockSize")
    6800                            .dwattr $C$DW$655, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6801                            .dwattr $C$DW$655, DW_AT_accessibility(DW_ACCESS_public)
    6802                            .dwattr $C$DW$655, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6803                            .dwattr $C$DW$655, DW_AT_decl_line(0xd7)
    6804                            .dwattr $C$DW$655, DW_AT_decl_column(0x08)
    6805                    
    6806                    $C$DW$656       .dwtag  DW_TAG_member
    6807                            .dwattr $C$DW$656, DW_AT_type(*$C$DW$T$9)
    6808                            .dwattr $C$DW$656, DW_AT_name("DeviceBlocksCapacity")
    6809                            .dwattr $C$DW$656, DW_AT_TI_symbol_name("DeviceBlocksCapacity")
    6810                            .dwattr $C$DW$656, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6811                            .dwattr $C$DW$656, DW_AT_accessibility(DW_ACCESS_public)
    6812                            .dwattr $C$DW$656, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6813                            .dwattr $C$DW$656, DW_AT_decl_line(0xd8)
    6814                            .dwattr $C$DW$656, DW_AT_decl_column(0x08)
    6815                    
    6816                    $C$DW$657       .dwtag  DW_TAG_member
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  125

    6817                            .dwattr $C$DW$657, DW_AT_type(*$C$DW$T$9)
    6818                            .dwattr $C$DW$657, DW_AT_name("NumOfAllocatedBlocks")
    6819                            .dwattr $C$DW$657, DW_AT_TI_symbol_name("NumOfAllocatedBlocks")
    6820                            .dwattr $C$DW$657, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6821                            .dwattr $C$DW$657, DW_AT_accessibility(DW_ACCESS_public)
    6822                            .dwattr $C$DW$657, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6823                            .dwattr $C$DW$657, DW_AT_decl_line(0xd9)
    6824                            .dwattr $C$DW$657, DW_AT_decl_column(0x08)
    6825                    
    6826                    $C$DW$658       .dwtag  DW_TAG_member
    6827                            .dwattr $C$DW$658, DW_AT_type(*$C$DW$T$9)
    6828                            .dwattr $C$DW$658, DW_AT_name("NumOfReservedBlocks")
    6829                            .dwattr $C$DW$658, DW_AT_TI_symbol_name("NumOfReservedBlocks")
    6830                            .dwattr $C$DW$658, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6831                            .dwattr $C$DW$658, DW_AT_accessibility(DW_ACCESS_public)
    6832                            .dwattr $C$DW$658, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6833                            .dwattr $C$DW$658, DW_AT_decl_line(0xda)
    6834                            .dwattr $C$DW$658, DW_AT_decl_column(0x08)
    6835                    
    6836                    $C$DW$659       .dwtag  DW_TAG_member
    6837                            .dwattr $C$DW$659, DW_AT_type(*$C$DW$T$9)
    6838                            .dwattr $C$DW$659, DW_AT_name("NumOfReservedBlocksForSystemfiles")
    6839                            .dwattr $C$DW$659, DW_AT_TI_symbol_name("NumOfReservedBlocksForSystemfiles")
    6840                            .dwattr $C$DW$659, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6841                            .dwattr $C$DW$659, DW_AT_accessibility(DW_ACCESS_public)
    6842                            .dwattr $C$DW$659, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6843                            .dwattr $C$DW$659, DW_AT_decl_line(0xdb)
    6844                            .dwattr $C$DW$659, DW_AT_decl_column(0x08)
    6845                    
    6846                    $C$DW$660       .dwtag  DW_TAG_member
    6847                            .dwattr $C$DW$660, DW_AT_type(*$C$DW$T$9)
    6848                            .dwattr $C$DW$660, DW_AT_name("LargestAllocatedGapInBlocks")
    6849                            .dwattr $C$DW$660, DW_AT_TI_symbol_name("LargestAllocatedGapInBlocks")
    6850                            .dwattr $C$DW$660, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6851                            .dwattr $C$DW$660, DW_AT_accessibility(DW_ACCESS_public)
    6852                            .dwattr $C$DW$660, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6853                            .dwattr $C$DW$660, DW_AT_decl_line(0xdc)
    6854                            .dwattr $C$DW$660, DW_AT_decl_column(0x08)
    6855                    
    6856                    $C$DW$661       .dwtag  DW_TAG_member
    6857                            .dwattr $C$DW$661, DW_AT_type(*$C$DW$T$9)
    6858                            .dwattr $C$DW$661, DW_AT_name("NumOfAvailableBlocksForUserFiles")
    6859                            .dwattr $C$DW$661, DW_AT_TI_symbol_name("NumOfAvailableBlocksForUserFiles")
    6860                            .dwattr $C$DW$661, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6861                            .dwattr $C$DW$661, DW_AT_accessibility(DW_ACCESS_public)
    6862                            .dwattr $C$DW$661, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6863                            .dwattr $C$DW$661, DW_AT_decl_line(0xdd)
    6864                            .dwattr $C$DW$661, DW_AT_decl_column(0x08)
    6865                    
    6866                    $C$DW$662       .dwtag  DW_TAG_member
    6867                            .dwattr $C$DW$662, DW_AT_type(*$C$DW$T$47)
    6868                            .dwattr $C$DW$662, DW_AT_name("Padding")
    6869                            .dwattr $C$DW$662, DW_AT_TI_symbol_name("Padding")
    6870                            .dwattr $C$DW$662, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6871                            .dwattr $C$DW$662, DW_AT_accessibility(DW_ACCESS_public)
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  126

    6872                            .dwattr $C$DW$662, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6873                            .dwattr $C$DW$662, DW_AT_decl_line(0xde)
    6874                            .dwattr $C$DW$662, DW_AT_decl_column(0x08)
    6875                    
    6876                            .dwattr $C$DW$T$48, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6877                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xd6)
    6878                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x01)
    6879                            .dwendtag $C$DW$T$48
    6880                    
    6881                    $C$DW$T$50      .dwtag  DW_TAG_typedef
    6882                            .dwattr $C$DW$T$50, DW_AT_name("SlFsControlDeviceUsage_t")
    6883                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$48)
    6884                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    6885                            .dwattr $C$DW$T$50, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    6886                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xdf)
    6887                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x03)
    6888                    
    6889                    
    6890                    $C$DW$T$49      .dwtag  DW_TAG_structure_type
    6891                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x14)
    6892                    $C$DW$663       .dwtag  DW_TAG_member
    6893                            .dwattr $C$DW$663, DW_AT_type(*$C$DW$T$6)
    6894                            .dwattr $C$DW$663, DW_AT_name("MaxFsFiles")
    6895                            .dwattr $C$DW$663, DW_AT_TI_symbol_name("MaxFsFiles")
    6896                            .dwattr $C$DW$663, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6897                            .dwattr $C$DW$663, DW_AT_accessibility(DW_ACCESS_public)
    6898                            .dwattr $C$DW$663, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6899                            .dwattr $C$DW$663, DW_AT_decl_line(0xe3)
    6900                            .dwattr $C$DW$663, DW_AT_decl_column(0x08)
    6901                    
    6902                    $C$DW$664       .dwtag  DW_TAG_member
    6903                            .dwattr $C$DW$664, DW_AT_type(*$C$DW$T$6)
    6904                            .dwattr $C$DW$664, DW_AT_name("IsDevlopmentFormatType")
    6905                            .dwattr $C$DW$664, DW_AT_TI_symbol_name("IsDevlopmentFormatType")
    6906                            .dwattr $C$DW$664, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    6907                            .dwattr $C$DW$664, DW_AT_accessibility(DW_ACCESS_public)
    6908                            .dwattr $C$DW$664, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6909                            .dwattr $C$DW$664, DW_AT_decl_line(0xe4)
    6910                            .dwattr $C$DW$664, DW_AT_decl_column(0x08)
    6911                    
    6912                    $C$DW$665       .dwtag  DW_TAG_member
    6913                            .dwattr $C$DW$665, DW_AT_type(*$C$DW$T$6)
    6914                            .dwattr $C$DW$665, DW_AT_name("Bundlestate")
    6915                            .dwattr $C$DW$665, DW_AT_TI_symbol_name("Bundlestate")
    6916                            .dwattr $C$DW$665, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6917                            .dwattr $C$DW$665, DW_AT_accessibility(DW_ACCESS_public)
    6918                            .dwattr $C$DW$665, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6919                            .dwattr $C$DW$665, DW_AT_decl_line(0xe5)
    6920                            .dwattr $C$DW$665, DW_AT_decl_column(0x08)
    6921                    
    6922                    $C$DW$666       .dwtag  DW_TAG_member
    6923                            .dwattr $C$DW$666, DW_AT_type(*$C$DW$T$6)
    6924                            .dwattr $C$DW$666, DW_AT_name("Reserved")
    6925                            .dwattr $C$DW$666, DW_AT_TI_symbol_name("Reserved")
    6926                            .dwattr $C$DW$666, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  127

    6927                            .dwattr $C$DW$666, DW_AT_accessibility(DW_ACCESS_public)
    6928                            .dwattr $C$DW$666, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6929                            .dwattr $C$DW$666, DW_AT_decl_line(0xe6)
    6930                            .dwattr $C$DW$666, DW_AT_decl_column(0x08)
    6931                    
    6932                    $C$DW$667       .dwtag  DW_TAG_member
    6933                            .dwattr $C$DW$667, DW_AT_type(*$C$DW$T$6)
    6934                            .dwattr $C$DW$667, DW_AT_name("MaxFsFilesReservedForSysFiles")
    6935                            .dwattr $C$DW$667, DW_AT_TI_symbol_name("MaxFsFilesReservedForSysFiles")
    6936                            .dwattr $C$DW$667, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6937                            .dwattr $C$DW$667, DW_AT_accessibility(DW_ACCESS_public)
    6938                            .dwattr $C$DW$667, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6939                            .dwattr $C$DW$667, DW_AT_decl_line(0xe7)
    6940                            .dwattr $C$DW$667, DW_AT_decl_column(0x08)
    6941                    
    6942                    $C$DW$668       .dwtag  DW_TAG_member
    6943                            .dwattr $C$DW$668, DW_AT_type(*$C$DW$T$6)
    6944                            .dwattr $C$DW$668, DW_AT_name("ActualNumOfUserFiles")
    6945                            .dwattr $C$DW$668, DW_AT_TI_symbol_name("ActualNumOfUserFiles")
    6946                            .dwattr $C$DW$668, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6947                            .dwattr $C$DW$668, DW_AT_accessibility(DW_ACCESS_public)
    6948                            .dwattr $C$DW$668, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6949                            .dwattr $C$DW$668, DW_AT_decl_line(0xe8)
    6950                            .dwattr $C$DW$668, DW_AT_decl_column(0x08)
    6951                    
    6952                    $C$DW$669       .dwtag  DW_TAG_member
    6953                            .dwattr $C$DW$669, DW_AT_type(*$C$DW$T$6)
    6954                            .dwattr $C$DW$669, DW_AT_name("ActualNumOfSysFiles")
    6955                            .dwattr $C$DW$669, DW_AT_TI_symbol_name("ActualNumOfSysFiles")
    6956                            .dwattr $C$DW$669, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6957                            .dwattr $C$DW$669, DW_AT_accessibility(DW_ACCESS_public)
    6958                            .dwattr $C$DW$669, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6959                            .dwattr $C$DW$669, DW_AT_decl_line(0xe9)
    6960                            .dwattr $C$DW$669, DW_AT_decl_column(0x08)
    6961                    
    6962                    $C$DW$670       .dwtag  DW_TAG_member
    6963                            .dwattr $C$DW$670, DW_AT_type(*$C$DW$T$6)
    6964                            .dwattr $C$DW$670, DW_AT_name("Padding")
    6965                            .dwattr $C$DW$670, DW_AT_TI_symbol_name("Padding")
    6966                            .dwattr $C$DW$670, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    6967                            .dwattr $C$DW$670, DW_AT_accessibility(DW_ACCESS_public)
    6968                            .dwattr $C$DW$670, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6969                            .dwattr $C$DW$670, DW_AT_decl_line(0xea)
    6970                            .dwattr $C$DW$670, DW_AT_decl_column(0x08)
    6971                    
    6972                    $C$DW$671       .dwtag  DW_TAG_member
    6973                            .dwattr $C$DW$671, DW_AT_type(*$C$DW$T$13)
    6974                            .dwattr $C$DW$671, DW_AT_name("NumOfAlerts")
    6975                            .dwattr $C$DW$671, DW_AT_TI_symbol_name("NumOfAlerts")
    6976                            .dwattr $C$DW$671, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6977                            .dwattr $C$DW$671, DW_AT_accessibility(DW_ACCESS_public)
    6978                            .dwattr $C$DW$671, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6979                            .dwattr $C$DW$671, DW_AT_decl_line(0xeb)
    6980                            .dwattr $C$DW$671, DW_AT_decl_column(0x08)
    6981                    
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  128

    6982                    $C$DW$672       .dwtag  DW_TAG_member
    6983                            .dwattr $C$DW$672, DW_AT_type(*$C$DW$T$13)
    6984                            .dwattr $C$DW$672, DW_AT_name("NumOfAlertsThreshold")
    6985                            .dwattr $C$DW$672, DW_AT_TI_symbol_name("NumOfAlertsThreshold")
    6986                            .dwattr $C$DW$672, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6987                            .dwattr $C$DW$672, DW_AT_accessibility(DW_ACCESS_public)
    6988                            .dwattr $C$DW$672, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6989                            .dwattr $C$DW$672, DW_AT_decl_line(0xec)
    6990                            .dwattr $C$DW$672, DW_AT_decl_column(0x08)
    6991                    
    6992                    $C$DW$673       .dwtag  DW_TAG_member
    6993                            .dwattr $C$DW$673, DW_AT_type(*$C$DW$T$9)
    6994                            .dwattr $C$DW$673, DW_AT_name("FATWriteCounter")
    6995                            .dwattr $C$DW$673, DW_AT_TI_symbol_name("FATWriteCounter")
    6996                            .dwattr $C$DW$673, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6997                            .dwattr $C$DW$673, DW_AT_accessibility(DW_ACCESS_public)
    6998                            .dwattr $C$DW$673, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    6999                            .dwattr $C$DW$673, DW_AT_decl_line(0xed)
    7000                            .dwattr $C$DW$673, DW_AT_decl_column(0x08)
    7001                    
    7002                    $C$DW$674       .dwtag  DW_TAG_member
    7003                            .dwattr $C$DW$674, DW_AT_type(*$C$DW$T$9)
    7004                            .dwattr $C$DW$674, DW_AT_name("Padding2")
    7005                            .dwattr $C$DW$674, DW_AT_TI_symbol_name("Padding2")
    7006                            .dwattr $C$DW$674, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    7007                            .dwattr $C$DW$674, DW_AT_accessibility(DW_ACCESS_public)
    7008                            .dwattr $C$DW$674, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7009                            .dwattr $C$DW$674, DW_AT_decl_line(0xee)
    7010                            .dwattr $C$DW$674, DW_AT_decl_column(0x08)
    7011                    
    7012                            .dwattr $C$DW$T$49, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    7013                            .dwattr $C$DW$T$49, DW_AT_decl_line(0xe2)
    7014                            .dwattr $C$DW$T$49, DW_AT_decl_column(0x01)
    7015                            .dwendtag $C$DW$T$49
    7016                    
    7017                    $C$DW$T$51      .dwtag  DW_TAG_typedef
    7018                            .dwattr $C$DW$T$51, DW_AT_name("SlFsControlFilesUsage_t")
    7019                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$49)
    7020                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    7021                            .dwattr $C$DW$T$51, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    7022                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xef)
    7023                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x02)
    7024                    
    7025                    
    7026                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    7027                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x24)
    7028                    $C$DW$675       .dwtag  DW_TAG_member
    7029                            .dwattr $C$DW$675, DW_AT_type(*$C$DW$T$50)
    7030                            .dwattr $C$DW$675, DW_AT_name("DeviceUsage")
    7031                            .dwattr $C$DW$675, DW_AT_TI_symbol_name("DeviceUsage")
    7032                            .dwattr $C$DW$675, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7033                            .dwattr $C$DW$675, DW_AT_accessibility(DW_ACCESS_public)
    7034                            .dwattr $C$DW$675, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7035                            .dwattr $C$DW$675, DW_AT_decl_line(0xf4)
    7036                            .dwattr $C$DW$675, DW_AT_decl_column(0x1e)
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  129

    7037                    
    7038                    $C$DW$676       .dwtag  DW_TAG_member
    7039                            .dwattr $C$DW$676, DW_AT_type(*$C$DW$T$51)
    7040                            .dwattr $C$DW$676, DW_AT_name("FilesUsage")
    7041                            .dwattr $C$DW$676, DW_AT_TI_symbol_name("FilesUsage")
    7042                            .dwattr $C$DW$676, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7043                            .dwattr $C$DW$676, DW_AT_accessibility(DW_ACCESS_public)
    7044                            .dwattr $C$DW$676, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7045                            .dwattr $C$DW$676, DW_AT_decl_line(0xf5)
    7046                            .dwattr $C$DW$676, DW_AT_decl_column(0x1e)
    7047                    
    7048                            .dwattr $C$DW$T$52, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    7049                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xf3)
    7050                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x01)
    7051                            .dwendtag $C$DW$T$52
    7052                    
    7053                    $C$DW$T$531     .dwtag  DW_TAG_typedef
    7054                            .dwattr $C$DW$T$531, DW_AT_name("SlFsControlGetStorageInfoResponse_t")
    7055                            .dwattr $C$DW$T$531, DW_AT_type(*$C$DW$T$52)
    7056                            .dwattr $C$DW$T$531, DW_AT_language(DW_LANG_C)
    7057                            .dwattr $C$DW$T$531, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    7058                            .dwattr $C$DW$T$531, DW_AT_decl_line(0xf6)
    7059                            .dwattr $C$DW$T$531, DW_AT_decl_column(0x03)
    7060                    
    7061                    
    7062                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    7063                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x0c)
    7064                    $C$DW$677       .dwtag  DW_TAG_member
    7065                            .dwattr $C$DW$677, DW_AT_type(*$C$DW$T$13)
    7066                            .dwattr $C$DW$677, DW_AT_name("IncludeFilters")
    7067                            .dwattr $C$DW$677, DW_AT_TI_symbol_name("IncludeFilters")
    7068                            .dwattr $C$DW$677, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7069                            .dwattr $C$DW$677, DW_AT_accessibility(DW_ACCESS_public)
    7070                            .dwattr $C$DW$677, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7071                            .dwattr $C$DW$677, DW_AT_decl_line(0xfa)
    7072                            .dwattr $C$DW$677, DW_AT_decl_column(0x0b)
    7073                    
    7074                    $C$DW$678       .dwtag  DW_TAG_member
    7075                            .dwattr $C$DW$678, DW_AT_type(*$C$DW$T$6)
    7076                            .dwattr $C$DW$678, DW_AT_name("OpenedForWriteCnt")
    7077                            .dwattr $C$DW$678, DW_AT_TI_symbol_name("OpenedForWriteCnt")
    7078                            .dwattr $C$DW$678, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7079                            .dwattr $C$DW$678, DW_AT_accessibility(DW_ACCESS_public)
    7080                            .dwattr $C$DW$678, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7081                            .dwattr $C$DW$678, DW_AT_decl_line(0xfb)
    7082                            .dwattr $C$DW$678, DW_AT_decl_column(0x0b)
    7083                    
    7084                    $C$DW$679       .dwtag  DW_TAG_member
    7085                            .dwattr $C$DW$679, DW_AT_type(*$C$DW$T$6)
    7086                            .dwattr $C$DW$679, DW_AT_name("OpeneForReadCnt")
    7087                            .dwattr $C$DW$679, DW_AT_TI_symbol_name("OpeneForReadCnt")
    7088                            .dwattr $C$DW$679, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    7089                            .dwattr $C$DW$679, DW_AT_accessibility(DW_ACCESS_public)
    7090                            .dwattr $C$DW$679, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7091                            .dwattr $C$DW$679, DW_AT_decl_line(0xfc)
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  130

    7092                            .dwattr $C$DW$679, DW_AT_decl_column(0x0b)
    7093                    
    7094                    $C$DW$680       .dwtag  DW_TAG_member
    7095                            .dwattr $C$DW$680, DW_AT_type(*$C$DW$T$6)
    7096                            .dwattr $C$DW$680, DW_AT_name("ClosedFilesCnt")
    7097                            .dwattr $C$DW$680, DW_AT_TI_symbol_name("ClosedFilesCnt")
    7098                            .dwattr $C$DW$680, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7099                            .dwattr $C$DW$680, DW_AT_accessibility(DW_ACCESS_public)
    7100                            .dwattr $C$DW$680, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7101                            .dwattr $C$DW$680, DW_AT_decl_line(0xfd)
    7102                            .dwattr $C$DW$680, DW_AT_decl_column(0x0b)
    7103                    
    7104                    $C$DW$681       .dwtag  DW_TAG_member
    7105                            .dwattr $C$DW$681, DW_AT_type(*$C$DW$T$6)
    7106                            .dwattr $C$DW$681, DW_AT_name("OpenedForWriteCntWithValidFailSafeImage")
    7107                            .dwattr $C$DW$681, DW_AT_TI_symbol_name("OpenedForWriteCntWithValidFailSafeImage")
    7108                            .dwattr $C$DW$681, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    7109                            .dwattr $C$DW$681, DW_AT_accessibility(DW_ACCESS_public)
    7110                            .dwattr $C$DW$681, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7111                            .dwattr $C$DW$681, DW_AT_decl_line(0xfe)
    7112                            .dwattr $C$DW$681, DW_AT_decl_column(0x0b)
    7113                    
    7114                    $C$DW$682       .dwtag  DW_TAG_member
    7115                            .dwattr $C$DW$682, DW_AT_type(*$C$DW$T$6)
    7116                            .dwattr $C$DW$682, DW_AT_name("OpeneForReadCntWithValidFailSafeImage")
    7117                            .dwattr $C$DW$682, DW_AT_TI_symbol_name("OpeneForReadCntWithValidFailSafeImage")
    7118                            .dwattr $C$DW$682, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7119                            .dwattr $C$DW$682, DW_AT_accessibility(DW_ACCESS_public)
    7120                            .dwattr $C$DW$682, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7121                            .dwattr $C$DW$682, DW_AT_decl_line(0xff)
    7122                            .dwattr $C$DW$682, DW_AT_decl_column(0x0b)
    7123                    
    7124                    $C$DW$683       .dwtag  DW_TAG_member
    7125                            .dwattr $C$DW$683, DW_AT_type(*$C$DW$T$6)
    7126                            .dwattr $C$DW$683, DW_AT_name("ClosedFilesCntWithValidFailSafeImage")
    7127                            .dwattr $C$DW$683, DW_AT_TI_symbol_name("ClosedFilesCntWithValidFailSafeImage")
    7128                            .dwattr $C$DW$683, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    7129                            .dwattr $C$DW$683, DW_AT_accessibility(DW_ACCESS_public)
    7130                            .dwattr $C$DW$683, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7131                            .dwattr $C$DW$683, DW_AT_decl_line(0x100)
    7132                            .dwattr $C$DW$683, DW_AT_decl_column(0x0b)
    7133                    
    7134                    $C$DW$684       .dwtag  DW_TAG_member
    7135                            .dwattr $C$DW$684, DW_AT_type(*$C$DW$T$47)
    7136                            .dwattr $C$DW$684, DW_AT_name("padding")
    7137                            .dwattr $C$DW$684, DW_AT_TI_symbol_name("padding")
    7138                            .dwattr $C$DW$684, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7139                            .dwattr $C$DW$684, DW_AT_accessibility(DW_ACCESS_public)
    7140                            .dwattr $C$DW$684, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7141                            .dwattr $C$DW$684, DW_AT_decl_line(0x101)
    7142                            .dwattr $C$DW$684, DW_AT_decl_column(0x0b)
    7143                    
    7144                            .dwattr $C$DW$T$53, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    7145                            .dwattr $C$DW$T$53, DW_AT_decl_line(0xf9)
    7146                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x01)
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  131

    7147                            .dwendtag $C$DW$T$53
    7148                    
    7149                    $C$DW$T$532     .dwtag  DW_TAG_typedef
    7150                            .dwattr $C$DW$T$532, DW_AT_name("SlFsControlGetCountersResponse_t")
    7151                            .dwattr $C$DW$T$532, DW_AT_type(*$C$DW$T$53)
    7152                            .dwattr $C$DW$T$532, DW_AT_language(DW_LANG_C)
    7153                            .dwattr $C$DW$T$532, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    7154                            .dwattr $C$DW$T$532, DW_AT_decl_line(0x102)
    7155                            .dwattr $C$DW$T$532, DW_AT_decl_column(0x03)
    7156                    
    7157                    
    7158                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    7159                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x0c)
    7160                    $C$DW$685       .dwtag  DW_TAG_member
    7161                            .dwattr $C$DW$685, DW_AT_type(*$C$DW$T$13)
    7162                            .dwattr $C$DW$685, DW_AT_name("FileMaxSize")
    7163                            .dwattr $C$DW$685, DW_AT_TI_symbol_name("FileMaxSize")
    7164                            .dwattr $C$DW$685, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7165                            .dwattr $C$DW$685, DW_AT_accessibility(DW_ACCESS_public)
    7166                            .dwattr $C$DW$685, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7167                            .dwattr $C$DW$685, DW_AT_decl_line(0x111)
    7168                            .dwattr $C$DW$685, DW_AT_decl_column(0x0a)
    7169                    
    7170                    $C$DW$686       .dwtag  DW_TAG_member
    7171                            .dwattr $C$DW$686, DW_AT_type(*$C$DW$T$13)
    7172                            .dwattr $C$DW$686, DW_AT_name("Properties")
    7173                            .dwattr $C$DW$686, DW_AT_TI_symbol_name("Properties")
    7174                            .dwattr $C$DW$686, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7175                            .dwattr $C$DW$686, DW_AT_accessibility(DW_ACCESS_public)
    7176                            .dwattr $C$DW$686, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7177                            .dwattr $C$DW$686, DW_AT_decl_line(0x112)
    7178                            .dwattr $C$DW$686, DW_AT_decl_column(0x0a)
    7179                    
    7180                    $C$DW$687       .dwtag  DW_TAG_member
    7181                            .dwattr $C$DW$687, DW_AT_type(*$C$DW$T$13)
    7182                            .dwattr $C$DW$687, DW_AT_name("FileAllocatedBlocks")
    7183                            .dwattr $C$DW$687, DW_AT_TI_symbol_name("FileAllocatedBlocks")
    7184                            .dwattr $C$DW$687, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7185                            .dwattr $C$DW$687, DW_AT_accessibility(DW_ACCESS_public)
    7186                            .dwattr $C$DW$687, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7187                            .dwattr $C$DW$687, DW_AT_decl_line(0x113)
    7188                            .dwattr $C$DW$687, DW_AT_decl_column(0x0a)
    7189                    
    7190                            .dwattr $C$DW$T$54, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    7191                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x110)
    7192                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x01)
    7193                            .dwendtag $C$DW$T$54
    7194                    
    7195                    $C$DW$T$533     .dwtag  DW_TAG_typedef
    7196                            .dwattr $C$DW$T$533, DW_AT_name("SlFileAttributes_t")
    7197                            .dwattr $C$DW$T$533, DW_AT_type(*$C$DW$T$54)
    7198                            .dwattr $C$DW$T$533, DW_AT_language(DW_LANG_C)
    7199                            .dwattr $C$DW$T$533, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    7200                            .dwattr $C$DW$T$533, DW_AT_decl_line(0x114)
    7201                            .dwattr $C$DW$T$533, DW_AT_decl_column(0x02)
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  132

    7202                    
    7203                    
    7204                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    7205                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x04)
    7206                    $C$DW$688       .dwtag  DW_TAG_member
    7207                            .dwattr $C$DW$688, DW_AT_type(*$C$DW$T$13)
    7208                            .dwattr $C$DW$688, DW_AT_name("KeepaliveEnabled")
    7209                            .dwattr $C$DW$688, DW_AT_TI_symbol_name("KeepaliveEnabled")
    7210                            .dwattr $C$DW$688, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7211                            .dwattr $C$DW$688, DW_AT_accessibility(DW_ACCESS_public)
    7212                            .dwattr $C$DW$688, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7213                            .dwattr $C$DW$688, DW_AT_decl_line(0xf7)
    7214                            .dwattr $C$DW$688, DW_AT_decl_column(0x0a)
    7215                    
    7216                            .dwattr $C$DW$T$55, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    7217                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xf6)
    7218                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x01)
    7219                            .dwendtag $C$DW$T$55
    7220                    
    7221                    $C$DW$T$534     .dwtag  DW_TAG_typedef
    7222                            .dwattr $C$DW$T$534, DW_AT_name("SlSockKeepalive_t")
    7223                            .dwattr $C$DW$T$534, DW_AT_type(*$C$DW$T$55)
    7224                            .dwattr $C$DW$T$534, DW_AT_language(DW_LANG_C)
    7225                            .dwattr $C$DW$T$534, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    7226                            .dwattr $C$DW$T$534, DW_AT_decl_line(0xf8)
    7227                            .dwattr $C$DW$T$534, DW_AT_decl_column(0x02)
    7228                    
    7229                    
    7230                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    7231                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    7232                    $C$DW$689       .dwtag  DW_TAG_member
    7233                            .dwattr $C$DW$689, DW_AT_type(*$C$DW$T$13)
    7234                            .dwattr $C$DW$689, DW_AT_name("ReuseaddrEnabled")
    7235                            .dwattr $C$DW$689, DW_AT_TI_symbol_name("ReuseaddrEnabled")
    7236                            .dwattr $C$DW$689, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7237                            .dwattr $C$DW$689, DW_AT_accessibility(DW_ACCESS_public)
    7238                            .dwattr $C$DW$689, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7239                            .dwattr $C$DW$689, DW_AT_decl_line(0xfc)
    7240                            .dwattr $C$DW$689, DW_AT_decl_column(0x0a)
    7241                    
    7242                            .dwattr $C$DW$T$56, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    7243                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xfb)
    7244                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x01)
    7245                            .dwendtag $C$DW$T$56
    7246                    
    7247                    $C$DW$T$535     .dwtag  DW_TAG_typedef
    7248                            .dwattr $C$DW$T$535, DW_AT_name("SlSockReuseaddr_t")
    7249                            .dwattr $C$DW$T$535, DW_AT_type(*$C$DW$T$56)
    7250                            .dwattr $C$DW$T$535, DW_AT_language(DW_LANG_C)
    7251                            .dwattr $C$DW$T$535, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/ne
    7252                            .dwattr $C$DW$T$535, DW_AT_decl_line(0xfd)
    7253                            .dwattr $C$DW$T$535, DW_AT_decl_column(0x02)
    7254                    
    7255                    
    7256                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
TI ARM Assembler Unix v18.1.3 Mon Sep 17 16:09:26 2018

Tools Copyright (c) 1996-2017 Texas Instruments Incorporated
slnetifwifi.asm                                                      PAGE  133

    7257                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x04)
    7258                    $C$DW$690       .dwtag  DW_TAG_member
    7259                            .dwattr $C$DW$690, DW_AT_type(*$C$DW$T$12)
    7260                            .dwattr $C$DW$690, DW_AT_name("RxIpNoBoundaryEnabled")
    7261                            .dwattr $C$DW$690, DW_AT_TI_symbol_name("RxIpNoBoundaryEnabled")
    7262                            .dwattr $C$DW$690, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7263                            .dwattr $C$DW$690, DW_AT_accessibility(DW_ACCESS_public)
    7264                            .dwattr $C$DW$690, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net/
    7265                            .dwattr $C$DW$690, DW_AT_decl_line(0x101)
    7266                            .dwattr $C$DW$690, DW_AT_decl_column(0x0a)
    7267                    
    7268                            .dwattr $C$DW$T$57, DW_AT_decl_file("/vagrant/SDK_Q3_GA_17_9_18/sdk_root/source/ti/drivers/net
    7269                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x100)
    7270                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x01)
    7271                            .dwendtag $C$DW$T$57
    7272                    
